In [1]:
import pandas as pd

In [8]:
data = {
    'Employee ID': [1, 2, 3, 4, 5, 6, 7],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Fiona', 'George'],
    'Age': [25, 26, 27, 28, 29, 30, 31],
    'Department': ['HR', 'Finance', 'Marketing', 'Sales', 'Operations', 'IT', 'Customer Service'],
    'Salary': [2500, 2600, 2700, 2800, 2900, 3000, 3100]
}

In [9]:
data

{'Employee ID': [1, 2, 3, 4, 5, 6, 7],
 'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Fiona', 'George'],
 'Age': [25, 26, 27, 28, 29, 30, 31],
 'Department': ['HR',
  'Finance',
  'Marketing',
  'Sales',
  'Operations',
  'IT',
  'Customer Service'],
 'Salary': [2500, 2600, 2700, 2800, 2900, 3000, 3100]}

In [11]:
df = pd.DataFrame(data)

In [12]:
df

   Employee ID     Name  Age        Department  Salary
0            1    Alice   25                HR    2500
1            2      Bob   26           Finance    2600
2            3  Charlie   27         Marketing    2700
3            4    David   28             Sales    2800
4            5      Eva   29        Operations    2900
5            6    Fiona   30                IT    3000
6            7   George   31  Customer Service    3100

In [13]:
df.head(5)

   Employee ID     Name  Age  Department  Salary
0            1    Alice   25          HR    2500
1            2      Bob   26     Finance    2600
2            3  Charlie   27   Marketing    2700
3            4    David   28       Sales    2800
4            5      Eva   29  Operations    2900

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Employee ID  7 non-null      int64
 1   Name         7 non-null      object
 2   Age          7 non-null      int64
 3   Department   7 non-null      object
 4   Salary       7 non-null      int64
dtypes: int64(3), object(2)
memory usage: 412.0+ bytes

In [15]:
df.describe()

       Employee ID        Age      Salary
count     7.000000   7.000000     7.00000
mean      4.000000  28.000000  2800.00000
std       2.160247   2.160247   216.02469
min       1.000000  25.000000  2500.00000
25%       2.500000  26.500000  2650.00000
50%       4.000000  28.000000  2800.00000
75%       5.500000  29.500000  2950.00000
max       7.000000  31.000000  3100.00000